Revit 2024 API
ParameterTypeId.CouplerMainBarSize Property
 "Bar Size 1"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId CouplerMainBarSize { get; }
Visual Basic
Public Shared ReadOnly Property CouplerMainBarSize As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ CouplerMainBarSize {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace